Ran Plan for project: `plateng-iac-597915711542-us-east-1` dir: `terraform/plateng-iac/597915711542/us-east-1` workspace: `plateng-iac-597915711542-us-east-1`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_s3_bucket.plateng-iac-s3-bucket-03 will be updated in-place
~ resource "aws_s3_bucket" "plateng-iac-s3-bucket-03" {
        id                          = "plateng-iac-s3-bucket-03"
      ~ tags                        = {
            "Name"                  = "plateng-iac-s3-bucket-03"
          - "platform:role"         = "null" -> null
          - "platform:system"       = "null" -> null
          - "tcss:creation-date"    = "2025-06-13T06:16:02Z" -> null
          - "tcss:creator"          = "yhegde" -> null
          - "tcss:network-exposure" = "null" -> null
        }
      ~ tags_all                    = {
          - "platform:role"         = "null" -> null
          - "platform:system"       = "null" -> null
          - "tcss:creation-date"    = "2025-06-13T06:16:02Z" -> null
          - "tcss:creator"          = "yhegde" -> null
          - "tcss:network-exposure" = "null" -> null
            # (8 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.plateng-iac-s3-bucket-test-03 will be created
+ resource "aws_s3_bucket" "plateng-iac-s3-bucket-test-03" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "plateng-iac-s3-bucket-test-03"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "plateng-iac-s3-bucket-test-03"
        }
      + tags_all                    = {
          + "Name"                = "plateng-iac-s3-bucket-test-03"
          + "claimed_ownership"   = "true"
          + "managed-by"          = "IacasS"
          + "platform:team"       = "plateng-iac"
          + "region"              = "us-east-1"
          + "tcss:classification" = "green"
          + "tcss:owner"          = "plateng-iac"
          + "tcss:tag-version"    = "1"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+ plateng-iac-s3-bucket-test-03_bucket_arn = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p plateng-iac-597915711542-us-east-1
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://RTJ6HHJY52:4141/lock?id=yogeehhegde%252Ftest-atlantis-1746531411-1%252Fterraform%252Fplateng-iac%252F597915711542%252Fus-east-1%252Fplateng-iac-597915711542-us-east-1)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p plateng-iac-597915711542-us-east-1
  ```
Plan: 1 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```